; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-7-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	p1-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s1)
	(at driver5 s1)
	(at driver6 s0)
	(at driver7 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s1)
	(at package2 s1)
	(at package3 s1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(link s0 s1)
	(link s1 s0)
)
	(:goal (and
	(at driver2 s0)
	(at driver4 s0)
	(at driver7 s1)
	(at truck1 s1)
	(at truck3 s0)
	(at truck6 s0)
	(at truck7 s0)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	))


)

; plan
1. (walk driver7 s0 p1-0)
   deleted: (at driver7 s0)
   added: (at driver7 p1-0)
   goals met: 4 of 10
2. (walk driver4 s1 p1-0)
   deleted: (at driver4 s1)
   added: (at driver4 p1-0)
   goals met: 4 of 10
3. (walk driver4 p1-0 s0)
   deleted: (at driver4 p1-0)
   added: (at driver4 s0)
   goals met: 5 of 10
4. (load-truck package3 truck7 s1)
   deleted: (at package3 s1)
   added: (in package3 truck7)
   goals met: 5 of 10
5. (load-truck package2 truck7 s1)
   deleted: (at package2 s1)
   added: (in package2 truck7)
   goals met: 5 of 10
6. (board-truck driver2 truck7 s1)
   deleted: (at driver2 s1) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 5 of 10
7. (drive-truck truck7 s1 s0 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 6 of 10
8. (disembark-truck driver2 truck7 s0)
   deleted: (driving driver2 truck7)
   added: (at driver2 s0) (empty truck7)
   goals met: 7 of 10
9. (unload-truck package2 truck7 s0)
   deleted: (in package2 truck7)
   added: (at package2 s0)
   goals met: 8 of 10
10. (unload-truck package3 truck7 s0)
   deleted: (in package3 truck7)
   added: (at package3 s0)
   goals met: 9 of 10
11. (walk driver7 p1-0 s1)
   deleted: (at driver7 p1-0)
   added: (at driver7 s1)
   goals met: 10 of 10
